---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayIterator.#ctor
source: html/d498061b-ce6d-1bbe-7f60-1c512d51dbdc.htm
---
# Autodesk.Revit.DB.EdgeArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public EdgeArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.